; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	spectrograph3 - mode
	spectrograph2 - mode
	image0 - mode
	spectrograph1 - mode
	GroundStation3 - direction
	Star2 - direction
	GroundStation1 - direction
	GroundStation0 - direction
	Planet4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet5)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument4 spectrograph3)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument5 image0)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument6 spectrograph3)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 GroundStation0)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation0)
)
(:goal (and
	(pointing satellite0 Planet10)
	(pointing satellite2 Planet7)
	(pointing satellite3 Planet10)
	(have_image Planet5 spectrograph1)
	(have_image Phenomenon6 image0)
	(have_image Planet7 spectrograph2)
	(have_image Planet8 image0)
	(have_image Phenomenon9 spectrograph1)
	(have_image Planet10 spectrograph2)
	(have_image Star11 image0)
	(have_image Planet12 image0)
	(have_image Planet13 spectrograph1)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 12
2. (calibrate satellite4 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 12
3. (turn_to satellite4 phenomenon6 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 phenomenon6)
   goals met: 0 of 12
4. (take_image satellite4 phenomenon6 instrument7 image0)
   added: (have_image phenomenon6 image0)
   goals met: 1 of 12
5. (turn_to satellite4 phenomenon9 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 phenomenon9)
   goals met: 1 of 12
6. (take_image satellite4 phenomenon9 instrument7 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 2 of 12
7. (turn_to satellite4 planet10 phenomenon9)
   deleted: (pointing satellite4 phenomenon9)
   added: (pointing satellite4 planet10)
   goals met: 2 of 12
8. (take_image satellite4 planet10 instrument7 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 3 of 12
9. (turn_to satellite4 planet12 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet12)
   goals met: 3 of 12
10. (take_image satellite4 planet12 instrument7 image0)
   added: (have_image planet12 image0)
   goals met: 4 of 12
11. (turn_to satellite4 planet13 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet13)
   goals met: 4 of 12
12. (take_image satellite4 planet13 instrument7 spectrograph1)
   added: (have_image planet13 spectrograph1)
   goals met: 5 of 12
13. (turn_to satellite4 planet5 planet13)
   deleted: (pointing satellite4 planet13)
   added: (pointing satellite4 planet5)
   goals met: 5 of 12
14. (take_image satellite4 planet5 instrument7 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 6 of 12
15. (turn_to satellite4 planet7 planet5)
   deleted: (pointing satellite4 planet5)
   added: (pointing satellite4 planet7)
   goals met: 6 of 12
16. (take_image satellite4 planet7 instrument7 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 7 of 12
17. (turn_to satellite4 planet8 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet8)
   goals met: 7 of 12
18. (take_image satellite4 planet8 instrument7 image0)
   added: (have_image planet8 image0)
   goals met: 8 of 12
19. (turn_to satellite4 star11 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star11)
   goals met: 8 of 12
20. (take_image satellite4 star11 instrument7 image0)
   added: (have_image star11 image0)
   goals met: 9 of 12
21. (turn_to satellite3 planet10 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 planet10)
   goals met: 10 of 12
22. (turn_to satellite2 planet7 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 planet7)
   goals met: 11 of 12
23. (turn_to satellite0 planet10 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet10)
   goals met: 12 of 12
